vernonet/stm32F4_prj/SPI_Prog/Src/chip_drv.c
/* Read JEDEC ID */
 int32_t ReadJedecId (uint8_t cmd, JEDEC_ID* jdc_id) {
  int32_t status; /* driver execution status */
  uint8_t buf[8]= {0};

  /* Select Slave */
  status = ptrSPI->Control(ARM_SPI_CONTROL_SS, ARM_SPI_SS_ACTIVE);

  if (status == ARM_DRIVER_OK) {
    /* Set command */
    //buf[0] = CMD_READ_RDID_SST;
		buf[0] = cmd;
		//buf[3] = 1;

    /* Send command and receive register value */
    status = ptrSPI->Transfer (&buf[0], &buf[4], 4U);

    if (status == ARM_DRIVER_OK) {
      /* Wait till transfer done */
      while (ptrSPI->GetDataCount() != 4U) {
				__asm("nop"); 
			};

      jdc_id->man_id = buf[5];
			jdc_id->dev_id = (buf[6] << 8) | buf[7];
    }
  }
  /* Deselect Slave */
  ptrSPI->Control(ARM_SPI_CONTROL_SS, ARM_SPI_SS_INACTIVE);
  
  return (status);
}
 
/* Read JEDEC ID */
 int32_t ReadIdSST ( uint8_t cmd, JEDEC_ID* jdc_id) {
  int32_t status; /* driver execution status */
  uint8_t buf[12] = {0};

  /* Select Slave */
  status = ptrSPI->Control(ARM_SPI_CONTROL_SS, ARM_SPI_SS_ACTIVE);

  if (status == ARM_DRIVER_OK) {
    /* Set command */
		buf[0] = cmd;//CMD_READ_RDID_SST;
		//buf[3] = 1;

    /* Send command and receive register value */
    status = ptrSPI->Transfer (&buf[0], &buf[6], 6U);

    if (status == ARM_DRIVER_OK) {
      /* Wait till transfer done */
      while (ptrSPI->GetDataCount() != 6U){
				__asm("nop");
			};

      jdc_id->man_id = buf[10];
			jdc_id->dev_id = buf[11];
    }
  }
  /* Deselect Slave */
  ptrSPI->Control(ARM_SPI_CONTROL_SS, ARM_SPI_SS_INACTIVE);
  
  return (status);
}



/**
  \fn          ARM_DRIVER_VERSION ARM_Flash_GetVersion (void)
  \brief       Get driver version.
  \return      \ref ARM_DRIVER_VERSION
*/
static ARM_DRIVER_VERSION GetVersion (void) {
  return DriverVersion;
}

/**
  \fn          ARM_FLASH_CAPABILITIES ARM_Flash_GetCapabilities (void)
  \brief       Get driver capabilities.
  \return      \ref ARM_FLASH_CAPABILITIES
*/
static ARM_FLASH_CAPABILITIES GetCapabilities (void) {
  return DriverCapabilities;
}

/**
  \fn          int32_t ARM_Flash_Initialize (ARM_Flash_SignalEvent_t cb_event)
  \brief       Initialize the Flash Interface.
  \param[in]   cb_event  Pointer to \ref ARM_Flash_SignalEvent
  \return      \ref execution_status
*/
 int32_t Initialize (ARM_Flash_SignalEvent_t cb_event) {
  int32_t status;
  (void)cb_event;

  FlashStatus.busy  = 0U;
  FlashStatus.error = 0U;

  status = ptrSPI->Initialize(NULL);
  if (status != ARM_DRIVER_OK) { return ARM_DRIVER_ERROR; }

  Flags = FLASH_INIT;
	
	

  return ARM_DRIVER_OK;
}

/**
  \fn          int32_t ARM_Flash_Uninitialize (void)
  \brief       De-initialize the Flash Interface.
  \return      \ref execution_status
*/
int32_t Uninitialize (void) {

  Flags = 0U;
  return ptrSPI->Uninitialize();
} 

/**
  \fn          int32_t ARM_Flash_PowerControl (ARM_POWER_STATE state)
  \brief       Control the Flash interface power.
  \param[in]   state  Power state
  \return      \ref execution_status
*/
 int32_t PowerControl (ARM_POWER_STATE state) {
  int32_t status;
	uint8_t buf;

  switch ((int32_t)state) {
    case ARM_POWER_OFF:
      Flags &= ~FLASH_POWER;

      FlashStatus.busy  = 0U;
      FlashStatus.error = 0U;

      return ptrSPI->PowerControl(ARM_POWER_FULL);

    case ARM_POWER_FULL:
      if ((Flags & FLASH_INIT) == 0U) {
        return ARM_DRIVER_ERROR;
      }

      if ((Flags & FLASH_POWER) == 0U) {
        status = ptrSPI->PowerControl(ARM_POWER_FULL);
        if (status != ARM_DRIVER_OK) {
          return ARM_DRIVER_ERROR;
        }
        status = ptrSPI->Control(ARM_SPI_MODE_MASTER | ARM_SPI_CPOL0_CPHA0  |
                                                       ARM_SPI_DATA_BITS(8) |
                                                       ARM_SPI_MSB_LSB      |
                                                       ARM_SPI_SS_MASTER_SW,
                                                       SPI_BUS_SPEED);
        if (status != ARM_DRIVER_OK) {
          return ARM_DRIVER_ERROR;
        }

        FlashStatus.busy  = 0U;
        FlashStatus.error = 0U;

        Flags |= FLASH_POWER;
				
//-----------------------------------------------------------------------------------				
			  flschip = ReadId();
				if (flschip != NULL) {
				/* Enable 4-byte addressing mode if flash chip supports it */
				if (flschip->total_size > 16384) { //size > 128Mbit
				if (flschip->feature_bits & (FEATURE_4BA_ENTER | FEATURE_4BA_ENTER_WREN | FEATURE_4BA_ENTER_EAR7) ) {
					  int ret;
					  ret = ReadConfigReg(CMD_READ_CONF_REG, &buf);  //
            if (ret != ARM_DRIVER_OK) return ret;    
						/* Check Flags Config register value */
						if (!(buf & (1<<5))) {  //5 - 4BA mode flag
							SPI_UsrLog("Enter to 4BA mode!\n");					
							ret = spi_enter_4ba();
							if (ret) {
							SPI_UsrLog("Failed to set correct 4BA mode! Aborting.\n");
							return ARM_DRIVER_ERROR;
		          }
						}
						else {
							SPI_UsrLog("4BA mode already enabled!\n");
							in_4ba_mode = true;
						}
            
	       }
				  //else spi_exit_4ba();
			   }
				}
//-----------------------------------------------------------------------------------				
      }
      return ARM_DRIVER_OK;

    case ARM_POWER_LOW:
      return ARM_DRIVER_ERROR_UNSUPPORTED;

    default:
      return ARM_DRIVER_ERROR;
  }
}

/**
  \fn          int32_t ARM_Flash_ReadData (uint32_t addr, void *data, uint32_t cnt)
  \brief       Read data from Flash.
  \param[in]   addr  Data address.
  \param[out]  data  Pointer to a buffer storing the data read from Flash.
  \param[in]   cnt   Number of data items to read.
  \return      number of data items read or \ref execution_status
*/
 int32_t ReadData (uint32_t addr, void *data, uint32_t cnt) {
	 
	//memset(data, 0, cnt); 
	SPI_UsrLog ("\n rd_addr -> 0x%05x   cnt -> 0x%03x", addr, cnt); 
  
  return (flschip->read(addr, data, cnt));
}
 
/**
  \fn          int32_t ARM_Flash_ReadData (uint32_t addr, void *data, uint32_t cnt)
  \brief       Read data from Flash.
  \param[in]   addr  Data address.
  \param[out]  data  Pointer to a buffer storing the data read from Flash.
  \param[in]   cnt   Number of data items to read.
  \return      number of data items read or \ref execution_status
*/
  int32_t spi_chip_read (uint32_t addr, void *data, uint32_t cnt) {
  uint8_t  buf[9];
  int32_t  status;
	uint8_t bytes=0;	

  if ((addr > (flschip->total_size*1024)) || (data == NULL)) {
    return ARM_DRIVER_ERROR_PARAMETER;
  }
	
	if ((addr & 0x3fff)  == 0) BSP_LED_Toggle(LED3);                //indicate reading


