vernonet/stm32F4_prj/SPI_Prog/Src/chip_drv.c
  /* Prepare Command with address */
	
	if (in_4ba_mode == false) {
		buf[0] = CMD_READ_DATA;
		buf[1] = (uint8_t)(addr >> 16);
		buf[2] = (uint8_t)(addr >>  8);
		buf[3] = (uint8_t)(addr >>  0);
		bytes = 4;
	}
	 else	 {
		buf[0] = CMD_READ_DATA;
		buf[1] = (uint8_t)(addr >> 24);
		buf[2] = (uint8_t)(addr >> 16);
		buf[3] = (uint8_t)(addr >>  8);
		buf[4] = (uint8_t)(addr >>  0);
		bytes = 5;

	}

  /* Select Slave */
  status = ptrSPI->Control(ARM_SPI_CONTROL_SS, ARM_SPI_SS_ACTIVE);

  if (status == ARM_DRIVER_OK) {
    /* Send Command with Address */
    status = ptrSPI->Send(buf, bytes);

    if (status == ARM_DRIVER_OK) {
      while (ptrSPI->GetDataCount() != bytes) {
				__asm("nop");
			};

      status = ptrSPI->Receive(data, cnt);

      if (status == ARM_DRIVER_OK) {
        while (ptrSPI->GetDataCount() != cnt) {
				__asm("nop");
			};
        
        /* Number of data items read */
        status = (int32_t)cnt;
      }
    }
  }
  ptrSPI->Control(ARM_SPI_CONTROL_SS, ARM_SPI_SS_INACTIVE);

	BSP_LED_Off(LED3); 
  return (status);
}
	


/**
  \fn          int32_t ARM_Flash_ProgramData (uint32_t addr, const void *data, uint32_t cnt)
  \brief       Program data to Flash.
  \param[in]   addr  Data address.
  \param[in]   data  Pointer to a buffer containing the data to be programmed to Flash.
  \param[in]   cnt   Number of data items to program.
  \return      number of data items programmed or \ref execution_status
*/
 int32_t ProgramData (uint32_t addr, const void *data, uint32_t cnt) {
	 //int32_t sts;
	 int32_t  status;
	 
	 if (!(flschip->write))  {
		  SPI_UsrLog("\n No write support!");
		  return ARM_DRIVER_ERROR_UNSUPPORTED;
	 }
	 if (flschip->unlock) {
		status = flschip->unlock(); // 
		if (status) return status;
		}
	 
	 SPI_UsrLog ("\n wr_addr -> 0x%05x   cnt -> 0x%03x", addr, cnt);
		
//	 /* Enable/disable 4-byte addressing mode if flash chip supports it */
//	 if (flschip->feature_bits & (FEATURE_4BA_ENTER | FEATURE_4BA_ENTER_WREN | FEATURE_4BA_ENTER_EAR7)) {
//		
//		if (in_4ba_mode == false) status = spi_enter_4ba();
//		
//		if (status) {
//			SPI_UsrLog ("Failed to set correct 4BA mode! Aborting.\n");
//			return 1;
//		}
//	}	
	 if ((addr & 0x1fff)  == 0) BSP_LED_Toggle(LED3);                //indicate writing
	
	 status = flschip->write(addr, data, cnt);
	
	 BSP_LED_Off(LED3); 
	
	 if (status < 0) {
		 SPI_UsrLog("\n ProgramData error -> %d", status);
	 }
  
  return (status);
}
 
/**
  \fn          int32_t ARM_Flash_ProgramData (uint32_t addr, const void *data, uint32_t cnt)
  \brief       Program data to Flash.
  \param[in]   addr  Data address.
  \param[in]   data  Pointer to a buffer containing the data to be programmed to Flash.
  \param[in]   cnt   Number of data items to program.
  \return      number of data items programmed or \ref execution_status
*/
 int32_t spi_chip_write_256 (uint32_t addr, const void *data, uint32_t cnt) {
  const uint8_t *buf;
        uint8_t  cmd[5];
        int32_t  status;
        uint32_t num, n;
	      uint8_t bytes=0;
	      uint16_t flash_page_size = flschip->page_size;

  if ((addr > (flschip->total_size*1024)) || (data == NULL)) {
    return ARM_DRIVER_ERROR_PARAMETER;
  }

  status = ARM_DRIVER_OK;

  num = 0U;
  buf = data;

  while (cnt) {
    /* Enable data write */
    status = SetWriteEnable();
    
    if (status == ARM_DRIVER_OK) {
      /* Select Slave */
      status = ptrSPI->Control(ARM_SPI_CONTROL_SS, ARM_SPI_SS_ACTIVE);
      
      if (status == ARM_DRIVER_OK) {
				     
        /* Prepare command with address */
				if (in_4ba_mode == false) {
        cmd[0] = CMD_PAGE_PROGRAM;
        cmd[1] = (uint8_t)(addr >> 16U);
        cmd[2] = (uint8_t)(addr >>  8U);
        cmd[3] = (uint8_t)(addr >>  0U);
				bytes = 4;
				}	
				else	 {
					cmd[0] = CMD_PAGE_PROGRAM;
					cmd[1] = (uint8_t)(addr >> 24);
					cmd[2] = (uint8_t)(addr >> 16);
					cmd[3] = (uint8_t)(addr >>  8);
					cmd[4] = (uint8_t)(addr >>  0);
					bytes = 5;
	}

        status = ptrSPI->Send(cmd, bytes);

        if (status == ARM_DRIVER_OK) {
          /* Wait until command and address are sent */
          while (ptrSPI->GetDataCount() != bytes){
				  __asm("nop");
			    };

          n = flash_page_size - (addr % flash_page_size);

          if (n > cnt) {
            n = cnt;
          }

          status = ptrSPI->Send(&buf[num], n);

          if (status == ARM_DRIVER_OK) {
            /* Wait until data sent */
            while (ptrSPI->GetDataCount() != n){
				     __asm("nop");
			      };

            addr += n;
            num  += n;
            cnt  -= n;
          }
        }
      }
      /* Deselect Slave */
      ptrSPI->Control(ARM_SPI_CONTROL_SS, ARM_SPI_SS_INACTIVE);

      if (status == ARM_DRIVER_OK) {
        /* Read status until device ready */
        do {
          status = ReadStatusReg(CMD_READ_STATUS, &cmd[0]);  //CMD_READ_FLAG_STATUS
          if (status != ARM_DRIVER_OK) {
            break;
          }

          /* Check Flags Status register value */
          if ((cmd[0] & 0x1U) != 1U) {
            FlashStatus.busy = 0U;
          }

        }
        while ((cmd[0] & 0x1U) == 0x1U);
      }
    }

    if (status != ARM_DRIVER_OK) {
      break;
    }
    /* Number of data items programmed */
    status = (int32_t)num;
  }

  return status;
}
 
/**
  \fn          int32_t ARM_Flash_ProgramData (uint32_t addr, const void *data, uint32_t cnt)
  \brief       Program data to Flash.
  \param[in]   addr  Data address.
  \param[in]   data  Pointer to a buffer containing the data to be programmed to Flash.
  \param[in]   cnt   Number of data items to program.
  \return      number of data items programmed or \ref execution_status
*/
 int32_t spi_chip_write_256_11 (uint32_t addr, const void *data, uint32_t cnt) {   //CMD_PAGE_PROGRAM_11 
  const uint8_t *buf;
        uint8_t  cmd[4];
        int32_t  status;
        uint32_t num, n;
	      uint16_t flash_page_size = flschip->page_size;

  if ((addr > (flschip->total_size*1024)) || (data == NULL)) {
    return ARM_DRIVER_ERROR_PARAMETER;
  }
	
	//printf ("\n addr -> 0x%05x   cnt -> 0x%03x", addr, cnt);

  status = ARM_DRIVER_OK;

  num = 0U;
  buf = data;

  while (cnt) {
//    /* Enable data write */
    status = ARM_DRIVER_OK;
    
    if (status == ARM_DRIVER_OK) {
      /* Select Slave */
      status = ptrSPI->Control(ARM_SPI_CONTROL_SS, ARM_SPI_SS_ACTIVE);
      
      if (status == ARM_DRIVER_OK) {
        /* Prepare command with address */
        cmd[0] = CMD_PAGE_PROGRAM_11;
        cmd[1] = (uint8_t)(addr >> 16U);
        cmd[2] = (uint8_t)(addr >>  8U);
        cmd[3] = (uint8_t)(addr >>  0U);

        status = ptrSPI->Send(cmd, 4U);

        if (status == ARM_DRIVER_OK) {
          /* Wait until command and address are sent */
          while (ptrSPI->GetDataCount() != 4U) {__asm("nop");};

