vernonet/stm32F4_prj/SPI_Prog/Src/chip_drv.c
  return status;
}
//static int32_t memcmp_(uint32_t * buf, uint32_t val,  uint32_t word_cnt){
//	
//  int32_t status = 0;
//	uint32_t addr;
//	
//	while (word_cnt){
//		if (*buf != val) return 1;
//		buf++;
//		word_cnt =-4;
//	}
//	return 0;
//}

static int32_t isErased (void) {
  uint32_t buf[0x40], buf_[0x40];
  int32_t status = 0;
	uint32_t addr;
	
	memset(buf_, 0xff, sizeof(buf_));
	for (addr=0; addr<flschip->total_size*1024;) {
		//if ((addr & 0x3fff)  == 0) BSP_LED_Toggle(LED3);
		ReadData(addr, (uint32_t *)&buf[0], sizeof(buf));
		status += memcmp(buf, buf_, sizeof(buf));
		//status += memcmp_(buf, 0xffffffff, sizeof(buf));
		if (status) break;
		addr += sizeof(buf)*4;
	}
	return status;
}

//static int32_t isLocked(void) {
//  uint8_t cmd[4];
//  int32_t status;
//	 
//	status = ReadStatusReg(CMD_READ_STATUS, &cmd[0]);  //
//          if (status == ARM_DRIVER_OK) {
//						if (cmd[0] & 0x0CU) {
//							 printf("\n Flash is locked for writing!!!");	
//							 return 1;
//						}	
//            else return ARM_DRIVER_OK;						
//					}
//					else return ARM_DRIVER_ERROR; 

//}

//int32_t spi_disable_blockprotect (void) {
//	uint8_t cmd[4], stat;
//  int32_t status;
//	 
//	if (isLocked() == 1){
//		if (WriteStatusReg(0)) return ARM_DRIVER_ERROR;
//		status = ReadStatusReg(CMD_READ_STATUS, &cmd[0]);  //CMD_READ_FLAG_STATUS
//          if (status != ARM_DRIVER_OK) {
//            return ARM_DRIVER_ERROR;
//          }
//          /* Check Flags Status register value */
//          if (cmd[0] & 0x0CU) {
//            return 1;
//          }
//					 else return ARM_DRIVER_OK;
//		
//	} 
//    else  if (isLocked() == ARM_DRIVER_OK) return ARM_DRIVER_OK;
//	      else return ARM_DRIVER_ERROR;
//}





/**
  \fn          int32_t ARM_Flash_EraseChip (void)
  \brief       Erase complete Flash.
               Optional function for faster full chip erase.
  \return      \ref execution_status
*/
 int32_t EraseChip (void) {
	 uint8_t i;
	 
	 if (!(flschip->erase)) {
		 SPI_UsrLog("\n No erase support!");
		 return ARM_DRIVER_ERROR_UNSUPPORTED;
	 }
	 for (i = 0; i < NUM_ERASEFUNCTIONS; i++) {
		 //search for a command to erase the entire chip,  not individual sectors
		 if (flschip->block_erasers[i].eraseblocks->count == 1 && flschip->block_erasers[i].eraseblocks[1].size == 0) break;
	 }
	 
	 return flschip->erase(flschip->block_erasers[i].block_erase);
 }
 
int32_t spi_erase_bulk (uint8_t cmd) {
  //uint8_t cmd[4];
  int32_t status;
	uint8_t buf[4];
	volatile int32_t led_tgl=30;
	
	 
	if (isErased() == 0) return ARM_DRIVER_OK; //no need execute erase
	 
	if (flschip->unlock) {  //(flschip->unlock == spi_disable_blockprotect)
		status = flschip->unlock();//spi_disable_blockprotect(); // 
		if (status) return status;
		}

  FlashStatus.busy  = 1U;
  FlashStatus.error = 0U;

	if (flschip->feature_bits & (FEATURE_WRSR_WREN | FEATURE_WREN)) {   //flschip->write != spi_chip_write_256_11
  status = SetWriteEnable();

  if (status == ARM_DRIVER_OK) {
    
		status = SendCmd(&cmd, 1U);
		
		do {
          status = ReadStatusReg(CMD_READ_STATUS, &buf[0]);  //CMD_READ_FLAG_STATUS
          if (status != ARM_DRIVER_OK) {
            break;
          }
					if (led_tgl-- == 0) {BSP_LED_Toggle(LED3); led_tgl = 10;}
		      HAL_Delay(1);
          /* Check Flags Status register value */
          if ((buf[0] & 0x1U) != 1U) {
            FlashStatus.busy = 0U;
          }

        }
        while ((buf[0] & 0x1U) == 0x1U);
  }
 }
	 if (isErased()){ 
	   SPI_UsrLog ("\n Flash not erased!!!\n");
		 return ARM_DRIVER_ERROR;
	 }
	   else SPI_UsrLog ("\n Flash erased!!!, all 0xFF\n");
   BSP_LED_Off(LED3);
   return status;
 
}


 int32_t spi_erase_bulk_sec (uint8_t cmd) {     //bulk erase on sectors
  int32_t status, addr;
	uint8_t buf[4];
	 
	if (isErased() == 0) return ARM_DRIVER_OK; //no need execute erase
	 	

  FlashStatus.busy  = 1U;
  FlashStatus.error = 0U;


	for(addr=0; addr<(flschip->total_size*1024); )  {

		buf[0] = CMD_SECTOR_ERASE;
		buf[1] = (uint8_t)(addr >> 16U);
		buf[2] = (uint8_t)(addr >>  8U);
		buf[3] = (uint8_t)(addr >>  0U);
		
		status = SendCmd(buf, 4U);
		
		do {
          status = ReadStatusReg(CMD_READ_STATUS, &buf[0]);  //CMD_READ_FLAG_STATUS
          if (status != ARM_DRIVER_OK) {
            break;
          }

          /* Check Flags Status register value */
          if ((buf[0] & 0x1U) != 1U) {
            FlashStatus.busy = 0U;
          }

        }
        while ((buf[0] & 0x1U) == 0x1U);
				addr += 4096;
			}
	
	
  if (isErased()) {
	   SPI_UsrLog("\n Flash not erased!!!\n")
	}
	   else SPI_UsrLog ("\n Flash erased!!!, all 0xFF\n");
  return status;
}

/**
  \fn          ARM_FLASH_STATUS ARM_Flash_GetStatus (void)
  \brief       Get Flash status.
  \return      Flash status \ref ARM_FLASH_STATUS
*/
static ARM_FLASH_STATUS GetStatus (void) {
  uint8_t val;

  if (FlashStatus.busy == 1U) {
    /* Read flag status register */
    if (ReadStatusReg (CMD_READ_STATUS, &val) == ARM_DRIVER_OK) {
      /* Check "Program or erase controller" bit */
      if ((val & 0x1U) != 0U) {
        FlashStatus.busy = 1U;
      }
			else {
				FlashStatus.busy = 0U;
				FlashStatus.error = 0U;
			}

    }
    else {
      FlashStatus.error = 1U;
    }
  }

  return FlashStatus;
}

/**
  \fn          ARM_FLASH_INFO * ARM_Flash_GetInfo (void)
  \brief       Get Flash information.
  \return      Pointer to Flash information \ref ARM_FLASH_INFO
*/
static ARM_FLASH_INFO * GetInfo (void) {
	
  return &FlashInfo;
}

ARM_SPI_STATUS Spi_status(void){
	ARM_SPI_STATUS stat;
	stat = ptrSPI->GetStatus();
	return stat;
}


/* Flash Driver Control Block */
extern
ARM_DRIVER_FLASH ARM_Driver_Flash_(DRIVER_FLASH_NUM);
ARM_DRIVER_FLASH ARM_Driver_Flash_(DRIVER_FLASH_NUM) = {
  GetVersion,
  GetCapabilities,
  Initialize,
  Uninitialize,
  PowerControl,
  ReadData,
  ProgramData,
  EraseSector,
  EraseChip,
  GetStatus,
  GetInfo
};
